Revit.Elements.Views.CeilingPlanView
A Revit ViewPlan

Revit.Elements.Views.CeilingPlanView.#ctor(Autodesk.Revit.DB.ViewPlan)
Private constructor

Revit.Elements.Views.CeilingPlanView.#ctor(Autodesk.Revit.DB.Level)
Private constructor

Revit.Elements.Views.CeilingPlanView.InitCeilingPlanView(Autodesk.Revit.DB.ViewPlan)
Initialize a CeilingPlanView element

Revit.Elements.Views.CeilingPlanView.InitCeilingPlanView(Autodesk.Revit.DB.Level)
Initialize a CeilingPlanView element

Revit.Elements.Views.CeilingPlanView.ByLevel(Revit.Elements.Level)
Create a Revit Floor Plan at a given Level
level:
Returns:

Revit.Elements.Views.CeilingPlanView.FromExisting(Autodesk.Revit.DB.ViewPlan,System.Boolean)
Create from existing Element
plan:
isRevitOwned:
Returns: